Revit 2024 API
FabricationPart.GetCalculatedDimensionValue Method
 Gets the calculated dimension value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string GetCalculatedDimensionValue(
	FabricationDimensionDefinition dim
)
Visual Basic
Public Function GetCalculatedDimensionValue ( _
	dim As FabricationDimensionDefinition _
) As String
Visual C++
public:
String^ GetCalculatedDimensionValue(
	FabricationDimensionDefinition^ dim
)
Parameters
dim
Type: Autodesk.Revit.DB.FabricationDimensionDefinition
 The fabrication dimension.
Return Value
 The calculated dimension value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace